# FTP(File Transfer Protocol)이란

> FTP란
    > 개요
    > 능동 모드 & 수동 모드
    > 보안
-------------------------------------------------------

## FTP란

사무실에서 스캐너를 사용하는데 IP 문제로 컴퓨터-스캐너가 작동을 안 해서 고생을 좀 했다.  
문득 어떤 이유로 데이터가 전송이 안 되나 궁금해서 원리를 찾아보니 FTP 스캔 방식이라는 게 있었다.
 
 
### 개요

복합기에서 FTP 프로그램을 이용하여 컴퓨터로 스캔한 파일을 전송한다.  
FTP란, 파일 전송 프로토콜을 일컫는 말으로 인터넷을 통해 컴퓨터-컴퓨터 간의 파일을 전송할 수 있도록 하는 방법과 그런 프로그램을 모두 포함한다. 
FTP에는 클라이언트와 서버 사이, 신호 및 명령 제어를 위한 포트(서비스 요청과 그에 대한 결과)와 파일 전송을 위한 포트가 존재한다. 

1. FTP 명령 포트는 21번으로, Client는 21번 포트를 통해 서버와 제어 연결을 설정한다. 
2. 이를 통해 사용자 계정과 비밀번호롤 전송한다.
3. 클라이언트가 명령을 전송한다. 
4. 서버는 파일 전송을 위한 명령을 받은 TCP data connection을 초기화 한다.
5. 하나의 파일 전송이 끝나면 data 연결을 닫는다. 


## 능동 모드 (Active Mode)
FTP는 데이터를 전송할 때 두 가지를 지원한다. 

1. Client -(20번 포트)-> FTP 접속을 시도
2. 서버는 ACK로 응답 후 서버의 
3. 20번 포트는 클라이언트가 알려준 두 번째 포트로 접속을 시도하고
4. 클라이언트가 ACK로 응답한다.

## 수동 모드 (Passive Mode)




FTP 통신은 TCP 통신을 하므로, *3-way handshaking 과정 이후 클라이언트가 명령어를 입력하면 서버가 숫자 코드로 응답한다.

